Процедура СоздатьУведомлениеТелеграмБоту(ТекстСообщения) Экспорт
	
	НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовыйЭлемент.ТекстСообщения = ТекстСообщения;
	НовыйЭлемент.Записать();
	
КонецПроцедуры

Функция ОтправитьСообщениеВТелеграм(ТекстСообщения)
	
	РезультатОтправки = Новый Структура;
	РезультатОтправки.Вставить("СообщениеОтправлено", Ложь);
	РезультатОтправки.Вставить("ТекстСообщения", "");

	ТокенТелеграм = Константы.ВКМ_ТокенБотаТелеграм.Получить();
	ИдентификаторГруппыТелеграм = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();

	Если Не ЗначениеЗаполнено(ТокенТелеграм) Или Не ЗначениеЗаполнено(ИдентификаторГруппыТелеграм) Тогда

		РезультатОтправки.СообщениеОтправлено = Ложь;
		РезультатОтправки.ТекстСообщения = "Не удалось отправить сообщение в телеграм - токен бота или идентификатор группы Телеграм не заполнены";

	КонецЕсли;

	Попытка

		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);

		АдресРесурса = СтрШаблон("bot%1/sendMessage", ТокенТелеграм);
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");

		Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);

		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("chat_id", ИдентификаторГруппыТелеграм);
		СтруктураСообщения.Вставить("text", ТекстСообщения);

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);
		ЗаписьJSON.Закрыть();

		Запрос.УстановитьТелоИзСтроки(ЗаписьJSON);

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);

		Если Ответ.КодСостояния = 200 Тогда

			РезультатОтправки.СообщениеОтправлено = Истина;

		Иначе

			РезультатОтправки.СообщениеОтправлено = Ложь;
			РезультатОтправки.ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();

		КонецЕсли;

	Исключение

		РезультатОтправки.СообщениеОтправлено = Ложь;
		РезультатОтправки.ТекстОшибки = ОписаниеОшибки();

	КонецПопытки;

	Возврат РезультатОтправки;	
	
КонецФункции
