Процедура ДополнитьФорму(Форма) Экспорт
	
    ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнить(Форма);
	ИначеЕсли ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьЭлементыАбонентскогоОбслуживания(Форма);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьКнопкуЗаполнить(Форма)

	Если Форма.Элементы.Найти("Заполнить") <> Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("ВКМ_ЗаполнитьДляАбонПлаты"); 
	Команда.Действие = "ВКМ_ЗаполнитьДляАбонПлаты";
	Команда.Заголовок = "Заполнить";
	
	Кнопка = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.Элементы.Услуги.КоманднаяПанель);
    Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.Отображение = ОтображениеКнопки.Текст;
    Кнопка.ИмяКоманды = "ВКМ_ЗаполнитьДляАбонПлаты";
	
КонецПроцедуры 

Процедура ДобавитьЭлементыАбонентскогоОбслуживания(Форма)

	Если Форма.Элементы.Найти("ГруппаАбонентскоеОбслуживание") <> Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ГруппаАбонентскоеОбслуживание = Форма.Элементы.Добавить("ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
	ГруппаАбонентскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаАбонентскоеОбслуживание.Видимость = Ложь;
	
	ГруппаПериодДействияДоговора = Форма.Элементы.Добавить("ГруппаПериодДействияДоговора", Тип("ГруппаФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Начало действия договора";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Окончание действия договора";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";

	ГруппаСтоимостьОбслуживания = Форма.Элементы.Добавить("ГруппаСтоимостьОбслуживания", Тип("ГруппаФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
	ГруппаСтоимостьОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимостьОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма.Элементы.ГруппаСтоимостьОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Сумма абон. платы";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма.Элементы.ГруппаСтоимостьОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Стоимость часа работы";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры 