Процедура ДополнитьФорму(Форма) Экспорт
	
    ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнить(Форма);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьКнопкуЗаполнить(Форма)

	Если Форма.Элементы.Найти("Заполнить") <> Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("ВКМ_ЗаполнитьДляАбонПлаты"); 
	Команда.Действие = "ВКМ_ЗаполнитьДляАбонПлаты";
	Команда.Заголовок = "Заполнить";
	
	Кнопка = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.Элементы.Услуги.КоманднаяПанель);
    Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.Отображение = ОтображениеКнопки.Текст;
    Кнопка.ИмяКоманды = "ВКМ_ЗаполнитьДляАбонПлаты";
	
КонецПроцедуры 