#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.Представление КАК ПредставлениеДоговора,
		|	ДоговорыКонтрагентов.ПометкаУдаления
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			
			ТекстСообщения = СтрШаблон("Вид выбранного договора %1 - %2. Необходимо выбрать договор с видом ""Абонентское обслуживание""", ВыборкаДетальныеЗаписи.ПредставлениеДоговора, ВыборкаДетальныеЗаписи.ВидДоговора);
			
		ИначеЕсли Дата < ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора Или Дата > ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора Тогда
			
			ТекстСообщения = СтрШаблон("Дата документа абонентского обслуживания должна попадать в период действия договора");
		
		ИначеЕсли ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
			
			ТекстСообщения = СтрШаблон("Выбранный договор %1 помечен на удаление!");
			
		Иначе
				
			СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;	
		
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = СтрШаблон("Не удалось получить данные по договору");
		
	КонецЕсли;
		
	Если ТекстСообщения <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
			
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти