#область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийГод = НачалоГода(ТекущаяДата());
	
	Для Счетчик = -5 По 5 Цикл
	
	ДобавляемыйГод = ТекущийГод - 31536000 * Счетчик;
	ПредставлениеГода = Сред(Строка(ДобавляемыйГод), 7, 4);
	
	Элементы.Год.СписокВыбора.Добавить(ДобавляемыйГод, ПредставлениеГода);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	РассчитатьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ТекущиеДанные.КатегорияСотрудника = ОтпускаСотрудниковСотрудникПриИзмененииНаСервере(ТекущиеДанные.Сотрудник); 
	
КонецПроцедуры

#КонецОбласти

#область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресТЗОтпусков = АнализГрафикаНаСервере();
	
	ПараметрыАнализаГрафика = Новый Структура;
	ПараметрыАнализаГрафика.Вставить("АдресТЗОтпусков", АдресТЗОтпусков);
	ПараметрыАнализаГрафика.Вставить("ГодАнализа", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыАнализаГрафика, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьДниОтпуска()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ПериодОтпуска = ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала;
	
	ТекущиеДанные.ДнейОтпуска = ПериодОтпуска / 86400;
	
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
	ТЗОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	
	АдресТЗОтпусков = ПоместитьВоВременноеХранилище(ТЗОтпусков, УникальныйИдентификатор);
	
	Возврат АдресТЗОтпусков;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтпускаСотрудниковСотрудникПриИзмененииНаСервере(Сотрудник)
		
	Возврат Сотрудник.КатегорияСотрудника;
	
КонецФункции

#КонецОбласти