#область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТЗОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресТЗОтпусков);
	ГодАнализа  = Параметры.ГодАнализа;
				
	Для Каждого Отпуск Из ТЗОтпусков Цикл
		
		Точка = ДиаграммаОтпусков.УстановитьТочку(Отпуск.Сотрудник);
		Точка.Текст = Отпуск.Сотрудник;
		
		Серия = ДиаграммаОтпусков.УстановитьСерию(Отпуск.КатегорияСотрудника);
		Серия.Текст = Отпуск.КатегорияСотрудника;   
		
		Значение = ДиаграммаОтпусков.ПолучитьЗначение(Точка, Серия);  

		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		Интервал.Текст = Отпуск.Сотрудник;  
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
