
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыплаты = РезультатЗапроса.Выгрузить();
	
	Объект.Выплаты.Загрузить(ТЗВыплаты);
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Выплаты.Количество() > 0 Тогда 
		
		ЗадатьВопросИЗаполнитьТаблицу(); 
		
	Иначе
		
		ЗаполнитьТаблицуНаСервере(); 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ЗадатьВопросИЗаполнитьТаблицу() 
	
	ТекстВопроса = СтрШаблон("Введённые в таблицу данные будут очищены.%1Продолжить?", Символы.ПС);
	Ответ = Ждать ВопросАсинх (ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		Объект.Выплаты.Очистить();
		ЗаполнитьТаблицуНаСервере();
		
	КонецЕсли;	
	
КонецПроцедуры

